Courses/7140/Lectures/Examples/Small-Set/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-12 Sat 23:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Example: SmallSet of Int</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Prabhaker Mateti" />
<meta name="description" content="Mateti: OO Programming and Design"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href=""> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Example: SmallSet of Int</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf1126d7">1. Abstract</a></li>
<li><a href="#org6674bff">2. SmallSet Requirements</a></li>
<li><a href="#orgcad91dd">3. SmallSet Specs</a></li>
<li><a href="#org7c2af94">4. SmallSet Design</a></li>
<li><a href="#org8aa7671">5. SmallSet Implementation</a></li>
<li><a href="#org8c14a9c">6. Exercises</a></li>
<li><a href="#org4e6c8c6">7. References</a></li>
<li><a href="#orgfa58000">8. End</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf1126d7" class="outline-2">
<h2 id="orgf1126d7"><span class="section-number-2">1</span> Abstract</h2>
<div class="outline-text-2" id="text-1">
<p>
This subtree of notes describes the requirements, specs, design and
implementation of a SmallSet of integers.  It is similar, but not
equivalent to Java Set.  Our description is focused on abstraction and
assertions.  This is expected to be a good example of software
engineering "in the tiny".  But, bug-free?!
</p>

<p>
It is also intended as an example for use later with learning JML
assertions, JUnit/TestNG, and FindBugs.
</p>

<p>
This is NOT an implementation of Java Set container.
</p>
</div>
</div>



<div id="outline-container-org6674bff" class="outline-2">
<h2 id="org6674bff"><span class="section-number-2">2</span> SmallSet Requirements</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li><a href="./SmallSet-reqs.html">./SmallSet-reqs.html</a></li>
</ol>
</div>
</div>

<div id="outline-container-orgcad91dd" class="outline-2">
<h2 id="orgcad91dd"><span class="section-number-2">3</span> SmallSet Specs</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li><a href="./SmallSet-specs.html">./SmallSet-specs.html</a></li>
</ol>
</div>
</div>


<div id="outline-container-org7c2af94" class="outline-2">
<h2 id="org7c2af94"><span class="section-number-2">4</span> SmallSet Design</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li><a href="./SmallSet-design.html">./SmallSet-design.html</a>  Illustrates <i>abstraction</i> in design</li>
<li>cf.  <a href="http://docs.oracle.com/javase/8/docs/api/java/util/Set.html">http://docs.oracle.com/javase/8/docs/api/java/util/Set.html</a>
The details of the Set as defined in Java API</li>
<li>Focus on the "methods"
<ol class="org-ol">
<li>not the size of code.</li>
<li>not the PL notation.</li>
<li>for now, not (even) Java.</li>
</ol></li>
<li>Not trying to match the Java Set API.</li>
</ol>
</div>
</div>


<div id="outline-container-org8aa7671" class="outline-2">
<h2 id="org8aa7671"><span class="section-number-2">5</span> SmallSet Implementation</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li><a href="./SmallSet-impl.html">./SmallSet-impl.html</a> implemented in Java; sloccount: java: 139 (100.00%)</li>
<li>Includes assertions.  Does not use JML.</li>
<li>This is NOT an implementation of Java Set container.</li>
<li><a href="./java-asserts.html">./java-asserts.html</a> Java Assert Practical Issues</li>
</ol>
</div>
</div>

<div id="outline-container-org8c14a9c" class="outline-2">
<h2 id="org8c14a9c"><span class="section-number-2">6</span> Exercises</h2>
<div class="outline-text-2" id="text-6">
<ol class="org-ol">
<li>Write javadoc comments.</li>
<li>Re-write the assertions in JML.</li>
<li>Is this bug-free? Present an objective discussion.  "This"
is what? Specs? Design? Impl?</li>
<li>Suppose we want a "large" set.  Specs [ought to] remain the same.
Design and implement so that there is no limit to the size (other
than memory exhaustion)?</li>
<li>Re-implement using the latest advances in Java 8+ and also in
Kotlin.  Write a comparison.</li>
</ol>
</div>
</div>

<div id="outline-container-org4e6c8c6" class="outline-2">
<h2 id="org4e6c8c6"><span class="section-number-2">7</span> References</h2>
<div class="outline-text-2" id="text-7">
<ol class="org-ol">
<li>C. A. R. Hoare, Proof of Correctness of Data Representations, Acta
Informatica, vol. 1, no. 4, pp. 271-281, 1972.  Hoare is a Turing
Award winner.  Reference.</li>

<li>Oracle.com, <a href="http://docs.oracle.com/javase/8/docs/technotes/guides/language/assert.html">Programming With Assertions</a>, 2015. Required Reading.</li>

<li>Robert Sedgewick,
<a href="https://www.cs.princeton.edu/~rs/AlgsDS07/01UnionFind.pdf">https://www.cs.princeton.edu/~rs/AlgsDS07/01UnionFind.pdf</a> 40+
slides, Union-Find Algorithms, 2007.  High performance designs use
union-find.  Recommended Reading.</li>

<li>Prabhaker Mateti, <a href="https://cecs.wright.edu/~pmateti/Courses/7100/Lectures/ADT/">Abstract Data Types</a>, a lecture from a PL course.
Recommended Reading.</li>

<li><a href="./SmallSet.java.html">./SmallSet.java.html</a> HTML of the code, colorized by a web tool.</li>
</ol>
</div>
</div>

<div id="outline-container-orgfa58000" class="outline-2">
<h2 id="orgfa58000"><span class="section-number-2">8</span> End</h2>
<div class="outline-text-2" id="text-8">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr>Copyright &copy; 2018 <a href="https://cecs.wright.edu/~pmateti">cecs.wright.edu/~pmateti</a> 2018-05-24 2020-09-12
</div>
</body>
</html>
